app/Http/Services/BookingService.php

    public function bookRoom($data)
    {
        $checkRoom = null;
        $checkFromTo = null;
        $checkDate = null;
        $date = date('y-m-d', strtotime($data['date']));
        $booking =DB::table('bookings')->where('room_id', $data['room_id'])->get();
        foreach ($booking as $book) {
            $checkRoom = $book->room_id;
        }
        $booking =DB::table('bookings')->where('date', $data['date'])->get();
        foreach ($booking as $book) {
            $checkDate = $book->date;
        }
        $booking =DB::table('bookings')->where('from_to', $data['from_to'])->get();
---
select * from `bookings` where `room_id` = '1'
select * from `bookings` where `date` = '11-11-2021'
select * from `bookings` where `from_to` = '08:00 - 09:00'

    public function checkRoom($idRoom, $date)
    {
        $date = date('Y-m-d', strtotime($date));
        $collection = Booking::where('room_id', $idRoom)->get();
        $getDate = Booking::where('date', $date)->get();
        $fromTo = FromTo::Pluck('from_to');
        $fromTos = FromTo::all();
        $result = '';
        $isEmpty = $collection->isEmpty();
        $isEmptyDate = $getDate->isEmpty();
        if ($isEmpty == false) {
            if ($isEmptyDate == false) {
                $getFromToByDate = Booking::where('date', $date)->where('room_id', $idRoom)->Pluck('from_to');
---
select * from `bookings` where `room_id` = '4'
select * from `bookings` where `date` = '2021-11-30'
select * from `from_tos`
select `from_to` from `bookings` where `date` = '2021-11-30' and `room_id` = '4'