app/Repositories/User/UserRepository.php

delete from `users` where `id` = '21'
---
    public function delete($id)
    {
        DB::beginTransaction();
        try {
            $user = $this->model->where('id', $id);
            $user->delete();