app/Http/Controllers/HomeController.php

select * from `from_tos`
select * from `bookings`
---
    public function index(Request $request)
    {
        $fromTo = FromTo::all();
        $booking = Booking::all();