app/Repositories/Booking/BookingRepository.php

select * from `bookings` where `room_id` = '39'
select * from `bookings` where `date` = '2021-11-03'
select * from `from_tos`
---
    public function checkRoom($idRoom, $date)
    {
        $date = date('Y-m-d', strtotime($date));
        $collection = Booking::where('room_id', $idRoom)->get();
        $getDate = Booking::where('date', $date)->get();
        $fromTo = FromTo::Pluck('from_to');
        $fromTos = FromTo::all();